app/controllers/programmers/solutions_controller.rb

SELECT "solutions".* FROM "solutions" WHERE "solutions"."status" = 'ACTIVE'
---
	def index
		if request.format.xls?
			@solutions = Solution.all
			response.headers['Content-Disposition'] = "attachment; filename= Solutions_#{Time.now.strftime("%d%m%Y%H%M%S")}.xls"
		else
			@solutions = Kaminari.paginate_array(Solution.where(status: :ACTIVE)).page(params[:page]).per(params[:per_page] || 10)