app/controllers/snmmaurya_controller.rb

	def downloads
		@downloads =  Kaminari.paginate_array(Download.order(created_at: :desc)).page(params[:page]).per(params[:per_page] || 10)
---
SELECT "downloads".* FROM "downloads"  ORDER BY "downloads"."created_at" DESC
SELECT COUNT(*) FROM "downloads"

	def portfolios
		@portfolios = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

	def about
		@user = User.find_by(role_id: 1)
---
SELECT  "users".* FROM "users" WHERE "users"."role_id" = $1 LIMIT 1  [["role_id", 1]]